FILE.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZTBF_16V2>
         <DOCUMENTHEADER>
            <BUSACT>RFBU</BUSACT>
            <USERNAME>CFERNANDES</USERNAME>
            <HEADERTXT/>
            <COMPCODE>PT02</COMPCODE>
            <DOC_DATE>2025-05-14</DOCDATE>
            <PSTNGDATE>2025-05-14</PSTNGDATE>
            <TRANSDATE>2025-05-14</TRANSDATE>
            <FISCYEAR>2025</FISCYEAR>
            <FISPERIOD>05</FISPERIOD>
            <DOC_TYPE>KR</DOCTYPE>
            <REF_DO_CNO>124</REFDOCNO>
            <DOCS_TATUS/>
         </DOCUMENTHEADER>
         <CURRENCYAMOUNT>
            <ITEM>
               <ITEMNOACC>1</ITEMNOACC>
               <CURRENCY/>
               <CURTYPE/>
               <CURRENCYISO>EUR</CURRENCYISO>
               <EXCHRATE/>
               <AMTDOCCUR>-196.80</AMTDOCCUR>
               <AMTBASE/>
            </ITEM>
            <ITEM>
               <ITEMNOACC>2</ITEMNOACC>
               <CURRENCY/>
               <CURTYPE/>
               <CURRENCYISO>EUR</CURRENCYISO>
               <EXCHRATE/>
               <AMTDOCCUR>160.00</AMTDOCCUR>
               <AMTBASE/>
            </ITEM>
            <ITEM>
               <ITEMNOACC>3</ITEMNOACC>
               <CURRENCY/>
               <CURTYPE/>
               <CURRENCYISO>EUR</CURRENCYISO>
               <EXCHRATE/>
               <AMTDOCCUR>36.80</AMTDOCCUR>
               <AMTBASE>160</AMTBASE>
            </ITEM>
         </CURRENCYAMOUNT>
         <ACCOUNTGL>
            <ITEM>
               <ITEMNOACC>2</ITEMNOACC>
               <GLACCOUNT>0000621000</GLACCOUNT>
               <COSTCENTER>PT02.0000</COSTCENTER>
               <ORDERID/>
               <PROFITCTR/>
               <TAXCODE>WD</TAXCODE>
               <FISPERIOD/>
               <FISCYEAR>2025</FISCYEAR>
            </ITEM>
         </ACCOUNTGL>
         <ACCOUNTPAYABLE>
            <ITEM>
               <ITEMNOACC>1</ITEMNOACC>
               <VENDORNO>0000100000</VENDORNO>
               <COMPCODE/>
               <PMNTTRMS>0030</PMNTTRMS>
               <BLINEDATE/>
               <PMNTBLOCK/>
               <PARTNERBK/>
               <TAXDATE/>
            </ITEM>
         </ACCOUNTPAYABLE>
         <ACCOUNTTAX>
            <ITEM>
               <ITEMNOACC>3</ITEMNOACC>
               <TAXCODE>WD</TAXCODE>
               <ACCTKEY/>
            </ITEM>
         </ACCOUNTTAX>
         <RETURN>
            <ITEM>
               <TYPE/>
               <ID/>
               <NUMBER/>
               <MESSAGE/>
               <LOGNO/>
               <LOGMSGNO/>
               <MESSAGEV1/>
               <MESSAGEV2/>
               <MESSAGEV3/>
               <MESSAGEV4/>
               <PARAMETER/>
               <ROW/>
               <FIELD/>
               <SYSTEM/>
            </ITEM>
         </RETURN>
      </urn:ZTBF_16V2>
   </soapenv:Body>
</soapenv:Envelope>

 
